## QOL

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/qol.csv')
df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_17,qol_18,qol_19,qol_20,qol_21,qol_22,qol_23,qol_24,qol_25,qol_26
0,Female,2017/ Final year,5,5,5,5,5,5,5,5,...,5,5,5,1,1,5,5,5,5,1
1,Male,2017/ Final year,4,4,3,3,4,4,4,4,...,4,4,3,4,1,3,4,4,4,3
2,Male,2017/ Final year,4,4,3,2,4,4,3,3,...,3,3,3,3,2,3,3,4,4,4
3,Female,2017/ Final year,4,4,2,1,5,4,3,5,...,5,5,5,2,5,4,5,5,5,5
4,Female,2017/ Final year,3,2,2,1,4,3,3,4,...,2,3,3,4,3,4,4,4,3,2

In [3]:
gender_dict = {'Male': 'M', 'Female': 'F'}
batch_dict = {'2020/ First year': 'First', '2017/ Final year': 'Final'}

df['gender'] = df['gender'].replace(gender_dict)
df['batch'] = df['batch'].replace(batch_dict)

df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_17,qol_18,qol_19,qol_20,qol_21,qol_22,qol_23,qol_24,qol_25,qol_26
0,F,Final,5,5,5,5,5,5,5,5,...,5,5,5,1,1,5,5,5,5,1
1,M,Final,4,4,3,3,4,4,4,4,...,4,4,3,4,1,3,4,4,4,3
2,M,Final,4,4,3,2,4,4,3,3,...,3,3,3,3,2,3,3,4,4,4
3,F,Final,4,4,2,1,5,4,3,5,...,5,5,5,2,5,4,5,5,5,5
4,F,Final,3,2,2,1,4,3,3,4,...,2,3,3,4,3,4,4,4,3,2

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Data columns (total 28 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   gender  194 non-null    object
 1   batch   194 non-null    object
 2   qol_1   194 non-null    int64
 3   qol_2   194 non-null    int64
 4   qol_3   194 non-null    int64
 5   qol_4   194 non-null    int64
 6   qol_5   194 non-null    int64
 7   qol_6   194 non-null    int64
 8   qol_7   194 non-null    int64
 9   qol_8   194 non-null    int64
 10  qol_9   194 non-null    int64
 11  qol_10  194 non-null    int64
 12  qol_11  194 non-null    int64
 13  qol_12  194 non-null    int64
 14  qol_13  194 non-null    int64
 15  qol_14  194 non-null    int64
 16  qol_15  194 non-null    int64
 17  qol_16  194 non-null    int64
 18  qol_17  194 non-null    int64
 19  qol_18  194 non-null    int64
 20  qol_19  194 non-null    int64
 21  qol_20  194 non-null    int64
 22  qol_21  194 non-null    int64
 23  qol_22  194 non-null    int64
 24  qol_23  194 non-null    int64
 25  qol_24  194 non-null    int64
 26  qol_25  194 non-null    int64
 27  qol_26  194 non-null    int64
dtypes: int64(26), object(2)
memory usage: 42.6+ KB

## Inversing scores for Question 3, 4 and 26

In [6]:
inv_dict = {1: 5, 2: 4, 3: 3, 4: 2, 5: 1}
df[['qol_3', 'qol_4', 'qol_26']] = df[['qol_3', 'qol_4', 'qol_26']].replace(inv_dict)

In [7]:
df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_17,qol_18,qol_19,qol_20,qol_21,qol_22,qol_23,qol_24,qol_25,qol_26
0,F,Final,5,5,1,1,5,5,5,5,...,5,5,5,1,1,5,5,5,5,5
1,M,Final,4,4,3,3,4,4,4,4,...,4,4,3,4,1,3,4,4,4,3
2,M,Final,4,4,3,4,4,4,3,3,...,3,3,3,3,2,3,3,4,4,2
3,F,Final,4,4,4,5,5,4,3,5,...,5,5,5,2,5,4,5,5,5,1
4,F,Final,3,2,4,5,4,3,3,4,...,2,3,3,4,3,4,4,4,3,4

## Total scores

In [12]:
df['total'] = df.iloc[:, 2:28].sum(axis=1)
df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_18,qol_19,qol_20,qol_21,qol_22,qol_23,qol_24,qol_25,qol_26,total
0,F,Final,5,5,1,1,5,5,5,5,...,5,5,1,1,5,5,5,5,5,114
1,M,Final,4,4,3,3,4,4,4,4,...,4,3,4,1,3,4,4,4,3,93
2,M,Final,4,4,3,4,4,4,3,3,...,3,3,3,2,3,3,4,4,2,84
3,F,Final,4,4,4,5,5,4,3,5,...,5,5,2,5,4,5,5,5,1,116
4,F,Final,3,2,4,5,4,3,3,4,...,3,3,4,3,4,4,4,3,4,93

## Total scores categories

In [13]:
bins = [0, 26, 51, 76, 101, 130]
labels = ['0-25', '26-50', '51-75', '76-100', '101-130']
df['total_cat'] = pd.cut(df['total'], bins=bins, labels=labels, right=False)

In [14]:
df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_19,qol_20,qol_21,qol_22,qol_23,qol_24,qol_25,qol_26,total,total_cat
0,F,Final,5,5,1,1,5,5,5,5,...,5,1,1,5,5,5,5,5,114,101-130
1,M,Final,4,4,3,3,4,4,4,4,...,3,4,1,3,4,4,4,3,93,76-100
2,M,Final,4,4,3,4,4,4,3,3,...,3,3,2,3,3,4,4,2,84,76-100
3,F,Final,4,4,4,5,5,4,3,5,...,5,2,5,4,5,5,5,1,116,101-130
4,F,Final,3,2,4,5,4,3,3,4,...,3,4,3,4,4,4,3,4,93,76-100

## Domain scores

In [15]:
domain_dict = {'Physical_health': ['qol_3', 'qol_4', 'qol_10', 'qol_15', 'qol_16', 'qol_17', 'qol_18'],
               'Psychological_health': ['qol_5', 'qol_6', 'qol_7', 'qol_11', 'qol_19', 'qol_26'],
               'Social relationships': ['qol_20', 'qol_21', 'qol_22'],
               'Environment': ['qol_8', 'qol_9', 'qol_12', 'qol_13', 'qol_14', 'qol_23', 'qol_24', 'qol_25']}

In [16]:
for domain, items in domain_dict.items():
    df[domain] = df[items].mean(axis=1) * 4

df.head()

,gender,batch,qol_1,qol_2,qol_3,qol_4,qol_5,qol_6,qol_7,qol_8,...,qol_23,qol_24,qol_25,qol_26,total,total_cat,Physical_health,Psychological_health,Social relationships,Environment
0,F,Final,5,5,1,1,5,5,5,5,...,5,5,5,5,114,101-130,15.428571,20.000000,9.333333,20.0
1,M,Final,4,4,3,3,4,4,4,4,...,4,4,4,3,93,76-100,14.285714,14.666667,10.666667,15.0
2,M,Final,4,4,3,4,4,4,3,3,...,3,4,4,2,84,76-100,12.571429,12.666667,10.666667,13.5
3,F,Final,4,4,4,5,5,4,3,5,...,5,5,5,1,116,101-130,19.428571,15.333333,14.666667,20.0
4,F,Final,3,2,4,5,4,3,3,4,...,4,4,3,4,93,76-100,15.428571,14.000000,14.666667,14.5

In [17]:
df.iloc[:, 29:33].describe()

       Physical_health  Psychological_health  Social relationships
count       194.000000            194.000000            194.000000
mean         13.670103             13.419244             12.549828
std           2.767151              2.986740              3.740593
min           4.000000              6.000000              4.000000
25%          12.000000             11.333333              9.333333
50%          13.714286             13.333333             12.000000
75%          15.428571             15.833333             14.666667
max          20.000000             20.000000             20.000000

The domain scores should fall between 4 and 20 as the manual suggests.